Tekla Open API Reference for Tekla Structures 2025
ModelHistory.UpdateModificationStampToLatest Method
 Updates the modification stamp to latest.
 Namespace: Tekla.Structures.Model.History
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static void UpdateModificationStampToLatest(
	string modificationStampKey
)
Public Shared Sub UpdateModificationStampToLatest (
	modificationStampKey As String
)
Parameters
modificationStampKey
Type: System.String
The modification stamp key.
See Also
Reference
ModelHistory Class
Tekla.Structures.Model.History Namespace